"""
4. Пользователь вводит строку из нескольких слов,
разделённых пробелами. Вывести каждое слово с новой строки.
Строки необходимо пронумеровать. Если слово длинное,
выводить только первые 10 букв в слове.

Пример:
Введите слова через пробел: раз два три
1. раз
2. два
3. три

Введите слова через пробел: раз перерефрижерированность
1. раз
2. перерефриж
"""

in_words = input('Введите слова через пробел: ').split()

for index_word, next_word in enumerate(in_words):
    print(f'{index_word + 1}. {(next_word, next_word[:10])[len(next_word) > 10]}')
