"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите два варианта решения: через list и через dict.

Пример:
Введите номер месяца: 10
Результат через список: Осень
Результат через словарь: Осень
"""

LIST_SEASON = ['Зима', 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето', 'Лето', 'Осень', 'Осень', 'Осень', 'Зима', ]

DICT_SEASON = {
    'Зима': [12, 1, 2],
    'Весна': [3, 4, 5],
    'Лето': [6, 7, 8],
    'Осень': [9, 10, 11],
}

in_month = int(input('Введите месяц в виде целого числа от 1 до 12: '))

dict_result = list_result = LIST_SEASON[in_month - 1]
list_result = None


for season_key, season_values in DICT_SEASON.items():

    if in_month in season_values:
        dict_result = season_key
        break

print(f'Результат через список: {list_result}')
print(f'Результат через словарь: {dict_result}')
